# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write complex queries
* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [3]:
#Your code here; import the necessary packages
import sqlite3

In [4]:
#Your code here; create the connection and cursor
conn = sqlite3.connect('data.sqlite')
curr = conn.cursor()

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [3]:
#Your code here; use a subquery. No join will be necessary.
curr.execute('''SELECT customernumber, contactlastname, contactfirstname FROM customers WHERE
                (SELECT orderdate FROM orders WHERE orderdate = '2003-01-31');''')
curr.fetchall()

[('103', 'Schmitt', 'Carine '),
 ('112', 'King', 'Jean'),
 ('114', 'Ferguson', 'Peter'),
 ('119', 'Labrune', 'Janine '),
 ('121', 'Bergulfsen', 'Jonas '),
 ('124', 'Nelson', 'Susan'),
 ('125', 'Piestrzeniewicz', 'Zbyszek '),
 ('128', 'Keitel', 'Roland'),
 ('129', 'Murphy', 'Julie'),
 ('131', 'Lee', 'Kwai'),
 ('141', 'Freyre', 'Diego '),
 ('144', 'Berglund', 'Christina '),
 ('145', 'Petersen', 'Jytte '),
 ('146', 'Saveley', 'Mary '),
 ('148', 'Natividad', 'Eric'),
 ('151', 'Young', 'Jeff'),
 ('157', 'Leong', 'Kelvin'),
 ('161', 'Hashimoto', 'Juri'),
 ('166', 'Victorino', 'Wendy'),
 ('167', 'Oeztan', 'Veysel'),
 ('168', 'Franco', 'Keith'),
 ('169', 'de Castro', 'Isabel '),
 ('171', 'Rancé', 'Martine '),
 ('172', 'Bertrand', 'Marie'),
 ('173', 'Tseng', 'Jerry'),
 ('175', 'King', 'Julie'),
 ('177', 'Kentary', 'Mory'),
 ('181', 'Frick', 'Michael'),
 ('186', 'Karttunen', 'Matti'),
 ('187', 'Ashworth', 'Rachel'),
 ('189', 'Cassidy', 'Dean'),
 ('198', 'Taylor', 'Leslie'),
 ('201', 'Devon', 'Elizabeth'),
 ('202', 'Tamuri', 'Yoshi '),
 ('204', 'Barajas', 'Miguel'),
 ('205', 'Young', 'Julie'),
 ('206', 'Walker', 'Brydey'),
 ('209', 'Citeaux', 'Frédérique '),
 ('211', 'Gao', 'Mike'),
 ('216', 'Saavedra', 'Eduardo '),
 ('219', 'Young', 'Mary'),
 ('223', 'Kloss', 'Horst '),
 ('227', 'Ibsen', 'Palle'),
 ('233', 'Fresnière', 'Jean '),
 ('237', 'Camino', 'Alejandra '),
 ('239', 'Thompson', 'Valarie'),
 ('240', 'Bennett', 'Helen '),
 ('242', 'Roulet', 'Annette '),
 ('247', 'Messner', 'Renate '),
 ('249', 'Accorti', 'Paolo '),
 ('250', 'Da Silva', 'Daniel'),
 ('256', 'Tonini', 'Daniel '),
 ('259', 'Pfalzheim', 'Henriette '),
 ('260', 'Lincoln', 'Elizabeth '),
 ('273', 'Franken', 'Peter '),
 ('276', "O'Hara", 'Anna'),
 ('278', 'Rovelli', 'Giovanni '),
 ('282', 'Huxley', 'Adrian'),
 ('286', 'Hernandez', 'Marta'),
 ('293', 'Harrison', 'Ed'),
 ('298', 'Holz', 'Mihael'),
 ('299', 'Klaeboe', 'Jan'),
 ('303', 'Schuyler', 'Bradley'),
 ('307', 'Andersen', 'Mel'),
 ('311', 'Koskitalo', 'Pirkko'),
 ('314', 'Dewey', 'Catherine '),
 ('319', 'Frick', 'Steve'),
 ('320', 'Huang', 'Wing'),
 ('321', 'Brown', 'Julie'),
 ('323', 'Graham', 'Mike'),
 ('324', 'Brown', 'Ann '),
 ('328', 'Brown', 'William'),
 ('333', 'Calaghan', 'Ben'),
 ('334', 'Suominen', 'Kalle'),
 ('335', 'Cramer', 'Philip '),
 ('339', 'Cervantes', 'Francisca'),
 ('344', 'Fernandez', 'Jesus'),
 ('347', 'Chandler', 'Brian'),
 ('348', 'McKenna', 'Patricia '),
 ('350', 'Lebihan', 'Laurence '),
 ('353', 'Henriot', 'Paul '),
 ('356', 'Kuger', 'Armand'),
 ('357', 'MacKinlay', 'Wales'),
 ('361', 'Josephs', 'Karin'),
 ('362', 'Yoshido', 'Juri'),
 ('363', 'Young', 'Dorothy'),
 ('369', 'Rodriguez', 'Lino '),
 ('376', 'Urs', 'Braun'),
 ('379', 'Nelson', 'Allen'),
 ('381', 'Cartrain', 'Pascale '),
 ('382', 'Pipps', 'Georg '),
 ('385', 'Cruz', 'Arnold'),
 ('386', 'Moroni', 'Maurizio '),
 ('398', 'Shimamura', 'Akiko'),
 ('406', 'Perrier', 'Dominique'),
 ('409', 'Müller', 'Rita '),
 ('412', 'McRoy', 'Sarah'),
 ('415', 'Donnermeyer', 'Michael'),
 ('424', 'Hernandez', 'Maria'),
 ('443', 'Feuer', 'Alexander '),
 ('447', 'Lewis', 'Dan'),
 ('448', 'Larsson', 'Martha'),
 ('450', 'Frick', 'Sue'),
 ('452', 'Mendel', 'Roland '),
 ('455', 'Murphy', 'Leslie'),
 ('456', 'Choi', 'Yu'),
 ('458', 'Sommer', 'Martín '),
 ('459', 'Ottlieb', 'Sven '),
 ('462', 'Benitez', 'Violeta'),
 ('465', 'Anton', 'Carmen'),
 ('471', 'Clenahan', 'Sean'),
 ('473', 'Ricotti', 'Franco'),
 ('475', 'Thompson', 'Steve'),
 ('477', 'Moos', 'Hanna '),
 ('480', 'Semenov', 'Alexander '),
 ('481', 'Altagar,G M', 'Raanan'),
 ('484', 'Roel', 'José Pedro '),
 ('486', 'Salazar', 'Rosa'),
 ('487', 'Taylor', 'Sue'),
 ('489', 'Smith', 'Thomas '),
 ('495', 'Franco', 'Valarie'),
 ('496', 'Snowden', 'Tony')]

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [9]:
#Your code here
#curr.execute('''SELECT productname, SUM(quanitityordered) FROM products
                JOIN orderdetails
                '''

[('1992 Ferrari 360 Spider red', 53, 1808),
 ('1937 Lincoln Berline', 28, 1111),
 ('American Airlines: MD-11S', 28, 1085),
 ('1941 Chevrolet Special Deluxe Cabriolet', 28, 1076),
 ('1930 Buick Marquette Phaeton', 28, 1074),
 ('1940s Ford truck', 28, 1061),
 ('1969 Harley Davidson Ultimate Chopper', 28, 1057),
 ('1957 Chevy Pickup', 28, 1056),
 ('1964 Mercedes Tour Bus', 28, 1053),
 ('1956 Porsche 356A Coupe', 27, 1052),
 ('Corsair F4U ( Bird Cage)', 28, 1051),
 ('F/A 18 Hornet 1/72', 28, 1047),
 ('1980s Black Hawk Helicopter', 28, 1040),
 ('1913 Ford Model T Speedster', 28, 1038),
 ('1997 BMW R 1100 S', 28, 1033),
 ('1972 Alfa Romeo GTA', 28, 1030),
 ('1962 Volkswagen Microbus', 28, 1029),
 ('2002 Suzuki XREO', 28, 1028),
 ('The USS Constitution Ship', 27, 1020),
 ('2001 Ferrari Enzo', 27, 1019),
 ('1960 BSA Gold Star DBD34', 28, 1015),
 ('1997 BMW F650 ST', 28, 1014),
 ('1957 Corvette Convertible', 27, 1013),
 ('18th century schooner', 27, 1011),
 ('1900s Vintage Tri-Plane', 28, 1009),
 ('1940 Ford Pickup Truck', 28, 999),
 ('1996 Moto Guzzi 1100i', 28, 999),
 ('1926 Ford Fire Engine', 28, 998),
 ('1982 Camaro Z28', 28, 997),
 ('1939 Cadillac Limousine', 28, 995),
 ('1917 Maxwell Touring Car', 28, 992),
 ('1969 Dodge Charger', 27, 992),
 ('2002 Yamaha YZR M1', 27, 992),
 ('1912 Ford Model T Delivery Wagon', 27, 991),
 ('1904 Buick Runabout', 27, 990),
 ('1996 Peterbilt 379 Stake Bed with Outrigger', 28, 988),
 ('1998 Chrysler Plymouth Prowler', 28, 986),
 ('1934 Ford V8 Coupe', 28, 985),
 ('2003 Harley-Davidson Eagle Drag Bike', 28, 985),
 ('America West Airlines B757-200', 28, 984),
 ('1936 Chrysler Airflow', 28, 983),
 ('1958 Chevy Corvette Limited Edition', 28, 983),
 ('Diamond T620 Semi-Skirted Tanker', 28, 979),
 ('1970 Dodge Coronet', 28, 976),
 ('1969 Dodge Super Bee', 27, 974),
 ('ATA: B757-300', 28, 973),
 ('1928 British Royal Navy Airplane', 28, 972),
 ('1928 Ford Phaeton Deluxe', 28, 972),
 ('1948 Porsche 356-A Roadster', 27, 972),
 ('1958 Setra Bus', 28, 972),
 ('1971 Alpine Renault 1600s', 27, 969),
 ('1962 City of Detroit Streetcar', 27, 966),
 ('1999 Yamaha Speed Boat', 28, 966),
 ('1969 Ford Falcon', 27, 965),
 ('1969 Corvair Monza', 27, 963),
 ('1952 Alpine Renault 1300', 28, 961),
 ('1936 Mercedes-Benz 500K Special Roadster', 28, 960),
 ('Boeing X-32A JSF', 28, 960),
 ('1957 Vespa GS150', 27, 959),
 ('Pont Yacht', 27, 958),
 ('1932 Model A Ford J-Coupe', 28, 957),
 ('1938 Cadillac V-16 Presidential Limousine', 28, 955),
 ('1954 Greyhound Scenicruiser', 28, 955),
 ('The Titanic', 27, 952),
 ('1949 Jaguar XK 120', 25, 949),
 ('1948 Porsche Type 356 Roadster', 25, 948),
 ('1982 Ducati 900 Monster', 27, 947),
 ('1993 Mazda RX-7', 27, 947),
 ('1936 Harley Davidson El Knucklehead', 28, 945),
 ('1970 Triumph Spitfire', 27, 945),
 ('1961 Chevrolet Impala', 27, 941),
 ('1900s Vintage Bi-Plane', 28, 940),
 ('1939 Chevrolet Deluxe Coupe', 28, 937),
 ("1950's Chicago Surface Lines Streetcar", 27, 934),
 ('The Schooner Bluenose', 27, 934),
 ('1968 Ford Mustang', 27, 933),
 ('1962 LanciaA Delta 16V', 28, 932),
 ('1968 Dodge Charger', 27, 925),
 ('1940 Ford Delivery Sedan', 28, 923),
 ('1917 Grand Touring Sedan', 25, 918),
 ('Collectable Wooden Train', 27, 918),
 ('1995 Honda Civic', 27, 917),
 ('P-51-D Mustang', 28, 917),
 ('1966 Shelby Cobra 427 S/C', 25, 915),
 ('1976 Ford Gran Torino', 27, 915),
 ('1965 Aston Martin DB5', 25, 914),
 ('1982 Lamborghini Diablo', 27, 912),
 ('1980’s GM Manhattan Express', 28, 911),
 ('18th Century Vintage Horse Carriage', 28, 907),
 ('1982 Ducati 996 R', 27, 906),
 ('1970 Plymouth Hemi Cuda', 27, 900),
 ('1974 Ducati 350 Mk3 Desmo', 27, 898),
 ('The Mayflower', 27, 898),
 ('HMS Bounty', 28, 897),
 ('The Queen Mary', 27, 896),
 ('2002 Chevy Corvette', 25, 894),
 ('American Airlines: B767-300', 28, 894),
 ('1937 Horch 930V Limousine', 28, 884),
 ('1903 Ford Model A', 27, 883),
 ('1928 Mercedes-Benz SSK', 28, 880),
 ('1952 Citroen-15CV', 24, 873),
 ('1969 Chevrolet Camaro Z28', 25, 870),
 ('1992 Porsche Cayenne Turbo Silver', 27, 867),
 ('1932 Alfa Romeo 8C2300 Spider Sport', 25, 866),
 ('1999 Indy 500 Monte Carlo SS', 25, 855),
 ('1911 Ford Town Car', 25, 832),
 ('1936 Mercedes Benz 500k Roadster', 25, 824),
 ('1970 Chevy Chevelle SS 454', 25, 803),
 ('1957 Ford Thunderbird', 24, 767)]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [9]:
#Your code here:
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products Which Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [11]:
#Your code here

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Who's Customers Have an Average Credit Limit of Over 15K

In [13]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!